<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>HTTPS</string>
                <key>ServerURL</key>
                <string>https://apple.dns.nextdns.io/aff4ad</string>
            </dict>
            <key>PayloadDescription</key>
            <string>🔥 Anti revoke + blacklist DNS ⚡</string>
            <key>PayloadDisplayName</key>
            <string>🛡️ Anti Revoke + Blacklist ✅</string>
            <key>PayloadIdentifier</key>
            <string>com.quanpro.antirevoke.dns</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>c5e9a632-b8b7-4b1f-95e3-9d7d7ac8e120</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>

    <key>PayloadDescription</key>
    <string>✨ Hồ sơ DNS chống thu hồi & blacklist — by Quân Pro 😎</string>
    <key>PayloadDisplayName</key>
    <string>🧩 Anti Revoke + Blacklist 🌐</string>
    <key>PayloadOrganization</key>
    <string>Quân Pro</string>
    <key>PayloadIdentifier</key>
    <string>com.quanpro.profile.antirevoke</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>fa28e4e7-0a1d-4f02-bb64-2b9a1c5f6c22</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadScope</key>
    <string>System</string>
</dict>
</plist>
